bench/k6-prefix.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/order-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m15s max duration (incl. graceful stop):
              * order_load: 40 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 40/40 VUs, 0 complete and 0 interrupted iterations
order_load   [   2% ] 40 VUs  01.0s/45s

running (0m02.0s), 40/40 VUs, 236 complete and 0 interrupted iterations
order_load   [   4% ] 40 VUs  02.0s/45s

running (0m03.0s), 40/40 VUs, 618 complete and 0 interrupted iterations
order_load   [   7% ] 40 VUs  03.0s/45s

running (0m04.0s), 40/40 VUs, 1000 complete and 0 interrupted iterations
order_load   [   9% ] 40 VUs  04.0s/45s

running (0m05.0s), 40/40 VUs, 1378 complete and 0 interrupted iterations
order_load   [  11% ] 40 VUs  05.0s/45s

running (0m06.0s), 40/40 VUs, 1760 complete and 0 interrupted iterations
order_load   [  13% ] 40 VUs  06.0s/45s

running (0m07.0s), 40/40 VUs, 2138 complete and 0 interrupted iterations
order_load   [  16% ] 40 VUs  07.0s/45s

running (0m08.0s), 40/40 VUs, 2538 complete and 0 interrupted iterations
order_load   [  18% ] 40 VUs  08.0s/45s

running (0m09.0s), 40/40 VUs, 2909 complete and 0 interrupted iterations
order_load   [  20% ] 40 VUs  09.0s/45s

running (0m10.0s), 40/40 VUs, 3298 complete and 0 interrupted iterations
order_load   [  22% ] 40 VUs  10.0s/45s

running (0m11.0s), 40/40 VUs, 3680 complete and 0 interrupted iterations
order_load   [  24% ] 40 VUs  11.0s/45s

running (0m12.0s), 40/40 VUs, 4058 complete and 0 interrupted iterations
order_load   [  27% ] 40 VUs  12.0s/45s

running (0m13.0s), 40/40 VUs, 4440 complete and 0 interrupted iterations
order_load   [  29% ] 40 VUs  13.0s/45s

running (0m14.0s), 40/40 VUs, 4840 complete and 0 interrupted iterations
order_load   [  31% ] 40 VUs  14.0s/45s

running (0m15.0s), 40/40 VUs, 5218 complete and 0 interrupted iterations
order_load   [  33% ] 40 VUs  15.0s/45s

running (0m16.0s), 40/40 VUs, 5600 complete and 0 interrupted iterations
order_load   [  36% ] 40 VUs  16.0s/45s

running (0m17.0s), 40/40 VUs, 6000 complete and 0 interrupted iterations
order_load   [  38% ] 40 VUs  17.0s/45s

running (0m18.0s), 40/40 VUs, 6360 complete and 0 interrupted iterations
order_load   [  40% ] 40 VUs  18.0s/45s

running (0m19.0s), 40/40 VUs, 6760 complete and 0 interrupted iterations
order_load   [  42% ] 40 VUs  19.0s/45s

running (0m20.0s), 40/40 VUs, 7125 complete and 0 interrupted iterations
order_load   [  44% ] 40 VUs  20.0s/45s

running (0m21.0s), 40/40 VUs, 7520 complete and 0 interrupted iterations
order_load   [  47% ] 40 VUs  21.0s/45s

running (0m22.0s), 40/40 VUs, 7920 complete and 0 interrupted iterations
order_load   [  49% ] 40 VUs  22.0s/45s

running (0m23.0s), 40/40 VUs, 8280 complete and 0 interrupted iterations
order_load   [  51% ] 40 VUs  23.0s/45s

running (0m24.0s), 40/40 VUs, 8680 complete and 0 interrupted iterations
order_load   [  53% ] 40 VUs  24.0s/45s

running (0m25.0s), 40/40 VUs, 9056 complete and 0 interrupted iterations
order_load   [  56% ] 40 VUs  25.0s/45s

running (0m26.0s), 40/40 VUs, 9440 complete and 0 interrupted iterations
order_load   [  58% ] 40 VUs  26.0s/45s

running (0m27.0s), 40/40 VUs, 9840 complete and 0 interrupted iterations
order_load   [  60% ] 40 VUs  27.0s/45s

running (0m28.0s), 40/40 VUs, 10200 complete and 0 interrupted iterations
order_load   [  62% ] 40 VUs  28.0s/45s

running (0m29.0s), 40/40 VUs, 10600 complete and 0 interrupted iterations
order_load   [  64% ] 40 VUs  29.0s/45s

running (0m30.0s), 40/40 VUs, 10960 complete and 0 interrupted iterations
order_load   [  67% ] 40 VUs  30.0s/45s

running (0m31.0s), 40/40 VUs, 11360 complete and 0 interrupted iterations
order_load   [  69% ] 40 VUs  31.0s/45s

running (0m32.0s), 40/40 VUs, 11760 complete and 0 interrupted iterations
order_load   [  71% ] 40 VUs  32.0s/45s

running (0m33.0s), 40/40 VUs, 12120 complete and 0 interrupted iterations
order_load   [  73% ] 40 VUs  33.0s/45s

running (0m34.0s), 40/40 VUs, 12520 complete and 0 interrupted iterations
order_load   [  76% ] 40 VUs  34.0s/45s

running (0m35.0s), 40/40 VUs, 12900 complete and 0 interrupted iterations
order_load   [  78% ] 40 VUs  35.0s/45s

running (0m36.0s), 40/40 VUs, 13280 complete and 0 interrupted iterations
order_load   [  80% ] 40 VUs  36.0s/45s

running (0m37.0s), 40/40 VUs, 13680 complete and 0 interrupted iterations
order_load   [  82% ] 40 VUs  37.0s/45s

running (0m38.0s), 40/40 VUs, 14040 complete and 0 interrupted iterations
order_load   [  84% ] 40 VUs  38.0s/45s

running (0m39.0s), 40/40 VUs, 14440 complete and 0 interrupted iterations
order_load   [  87% ] 40 VUs  39.0s/45s

running (0m40.0s), 40/40 VUs, 14840 complete and 0 interrupted iterations
order_load   [  89% ] 40 VUs  40.0s/45s

running (0m41.0s), 40/40 VUs, 15200 complete and 0 interrupted iterations
order_load   [  91% ] 40 VUs  41.0s/45s

running (0m42.0s), 40/40 VUs, 15600 complete and 0 interrupted iterations
order_load   [  93% ] 40 VUs  42.0s/45s

running (0m43.0s), 40/40 VUs, 15960 complete and 0 interrupted iterations
order_load   [  96% ] 40 VUs  43.0s/45s

running (0m44.0s), 40/40 VUs, 16360 complete and 0 interrupted iterations
order_load   [  98% ] 40 VUs  44.0s/45s

running (0m45.0s), 40/40 VUs, 16760 complete and 0 interrupted iterations
order_load   [ 100% ] 40 VUs  45.0s/45s


  █ TOTAL RESULTS 

    checks_total.......: 16800   372.569317/s
    checks_succeeded...: 100.00% 16800 out of 16800
    checks_failed......: 0.00%   0 out of 16800

    ✓ got a response (status != 0)

    CUSTOM
    orders_conflict_409............: 16634  368.887977/s
    orders_servererror_500.........: 146    3.237805/s
    orders_success_200.............: 20     0.443535/s

    HTTP
    http_req_duration..............: avg=6.96ms   min=1.53ms  med=3.69ms  max=1.17s p(90)=4.87ms   p(95)=5.67ms   p(99)=13.59ms 
      { expected_response:true }...: avg=392.39ms min=38.86ms med=88.41ms max=1.17s p(90)=1.12s    p(95)=1.14s    p(99)=1.16s   
    http_req_failed................: 99.88% 16780 out of 16800
    http_reqs......................: 16800  372.569317/s

    EXECUTION
    iteration_duration.............: avg=107.34ms min=101.6ms med=104.1ms max=1.28s p(90)=105.33ms p(95)=106.02ms p(99)=114.42ms
    iterations.....................: 16800  372.569317/s
    vus............................: 40     min=40             max=40
    vus_max........................: 40     min=40             max=40

    NETWORK
    data_received..................: 4.7 MB 104 kB/s
    data_sent......................: 4.3 MB 96 kB/s



running (0m45.1s), 00/40 VUs, 16800 complete and 0 interrupted iterations
order_load ✓ [ 100% ] 40 VUs  45s